tests/offline/Mock/PostRefundFailure.txt

HTTP/1.1 200 OK
Date: Wed, 01 Jul 2015 16:04:16 GMT 
Server: Apache-Coyote/1.1 
Strict-Transport-Security: max-age=63072000; includeSubdomains; preload 
X-Content-Type-Options: nosniff 
X-XSS-Protection: 1; mode=block 
Content-Type: text/plain 
Vary: Accept-Encoding 
Connection: close 
Transfer-Encoding: chunked  

TRANSACTION.CHANNEL=52275ebaf361f20a76b038ba4c806991&PRESENTATION.CURRENCY=EUR&IDENTIFICATION.UNIQUEID=SOME_TRANSACTION_IDENTIFICATION_UNIQUE_ID_5&PAYMENT.CODE=CC.RF&FRONTEND.CC_LOGO=images%2Fvisa_mc.gif&PROCESSING.STATUS=REJECTED_VALIDATION&CONTACT.IP=192.0.2.1&FRONTEND.MODE=DEFAULT&FRONTEND.REQUEST.CANCELLED=false&PROCESSING.RETURN=cannot+refund+%28refund+volume+exceeded+or+tx+reversed+or+invalid+workflow%3F%29&IDENTIFICATION.INVOICEID=Test+refund+invoice+ID&PROCESSING.REASON=Reference+Error&PROCESSING.STATUS.CODE=70&SECURITY.HASH=somesecurityhash5&TRANSACTION.MODE=INTEGRATOR_TEST&IDENTIFICATION.SHOPPERID=Test+shopper&POST.VALIDATION=ACK&PROCESSING.TIMESTAMP=2015-07-01+16%3A04%3A16&PROCESSING.RETURN.CODE=700.400.200&RESPONSE.VERSION=1.0&IDENTIFICATION.REFERENCEID=SOME_TRANSACTION_IDENTIFICATION_UNIQUE_ID_1&TRANSACTION.RESPONSE=SYNC&P3.VALIDATION=ACK&PROCESSING.CODE=CC.RF.70.30&FRONTEND.SESSION_ID=&PROCESSING.REASON.CODE=30&IDENTIFICATION.SHORTID=some.short.id5&PAYMENT.MEMO=Test+refunding&NAME.SALUTATION=NONE&PROCESSING.RESULT=NOK&IDENTIFICATION.TRANSACTIONID=TEST_REFUND_3_ID&PRESENTATION.AMOUNT=0.30&ADDRESS.COUNTRY=DE
