tests/offline/Mock/PostRefundSuccess.txt

HTTP/1.1 200 OK
Date: Wed, 01 Jul 2015 16:04:15 GMT 
Server: Apache-Coyote/1.1 
Strict-Transport-Security: max-age=63072000; includeSubdomains; preload 
X-Content-Type-Options: nosniff 
X-XSS-Protection: 1; mode=block 
Content-Type: text/plain 
Vary: Accept-Encoding 
Connection: close 
Transfer-Encoding: chunked  

P3.VALIDATION=ACK&IDENTIFICATION.SHOPPERID=Test+shopper&CLEARING.DESCRIPTOR=some.short.id4+pay.testweb.de&TRANSACTION.CHANNEL=52275ebaf361f20a76b038ba4c806991&PROCESSING.REASON.CODE=00&PROCESSING.CODE=CC.RF.90.00&FRONTEND.REQUEST.CANCELLED=false&PROCESSING.REASON=Successful+Processing&FRONTEND.MODE=DEFAULT&CLEARING.FXSOURCE=INTERN&CLEARING.AMOUNT=0.40&PROCESSING.RESULT=ACK&NAME.SALUTATION=NONE&IDENTIFICATION.INVOICEID=Test+refund+invoice+ID&POST.VALIDATION=ACK&CLEARING.CURRENCY=EUR&FRONTEND.SESSION_ID=&PROCESSING.STATUS.CODE=90&PRESENTATION.CURRENCY=EUR&PAYMENT.CODE=CC.RF&PROCESSING.RETURN.CODE=000.100.110&CONTACT.IP=192.0.2.1&IDENTIFICATION.REFERENCEID=SOME_TRANSACTION_IDENTIFICATION_UNIQUE_ID_1&PROCESSING.STATUS=NEW&SECURITY.HASH=somesecurityhash4&FRONTEND.CC_LOGO=images%2Fvisa_mc.gif&PRESENTATION.AMOUNT=0.40&IDENTIFICATION.UNIQUEID=SOME_TRANSACTION_IDENTIFICATION_UNIQUE_ID_4&IDENTIFICATION.TRANSACTIONID=TEST_REFUND_1_ID&IDENTIFICATION.SHORTID=some.short.id4&CLEARING.FXRATE=1.0&PROCESSING.TIMESTAMP=2015-07-01+16%3A04%3A15&PAYMENT.MEMO=Test+refunding&ADDRESS.COUNTRY=DE&RESPONSE.VERSION=1.0&TRANSACTION.MODE=INTEGRATOR_TEST&TRANSACTION.RESPONSE=SYNC&PROCESSING.RETURN=Request+successfully+processed+in+%27Merchant+in+Integrator+Test+Mode%27&CLEARING.FXDATE=2015-07-01+16%3A04%3A14
